# Taps
tap "hashicorp/tap"

# Essential CLI Tools
brew "git"
brew "wget"
brew "htop"
brew "tree"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "starship"
brew "neovim"

# Development Tools
brew "pyenv"
brew "rustup-init"
brew "go"
brew "nvm"
brew "kubernetes-cli"
brew "helm"

# Media & Network Tools
brew "ffmpeg"
brew "yt-dlp"
brew "nmap"
brew "aircrack-ng"

# Security & Analysis
brew "sqlmap"
brew "binwalk"
brew "pngcheck"
brew "fcrackzip"
brew "imagemagick"
brew "exiftool"

# Database
brew "mongosh"
brew "postgresql@14"
brew "redis"
brew "mysql"

# .NET
brew "dotnet"

# Development Applications
cask "visual-studio-code"
cask "cursor"
cask "warp"
cask "docker"
cask "postman"
cask "microsoft-azure-storage-explorer"

# Browsers
cask "google-chrome"
cask "arc"
cask "zen"

# Communication
cask "whatsapp"
cask "discord"
cask "microsoft-teams"

# Productivity
cask "raycast"
cask "notion"
cask "obsidian"
cask "todoist"
cask "claude"

# Design
# cask "figma"
cask "sketch"

# Utilities
cask "the-unarchiver"
cask "appcleaner"
cask "motrix"
cask "keka"
# cask "bartender"
cask "rectangle"
cask "karabiner-elements"

# Cloud Storage
cask "google-drive"
cask "dropbox"

# Entertainment
cask "spotify"
cask "plex"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-sf-mono"
cask "font-cascadia-code"
cask "font-victor-mono"
