tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Dev tools
brew "pyenv"
brew "rustup-init"
brew "git"
brew "ffmpeg"
brew "fprobe"
brew "mongosh"
brew "yt-dlp"
brew "wget"
brew "nvm"
brew "aircrack-ng"
brew "nmap"
brew "sqlmap"
brew "pngcheck"
brew "binwalk"
brew "fcrackzip"
brew "netpbm"
brew "imagemagick"
brew "gs"
# brew "openssh"

# Apps
cask "raycast"
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "font-fira-code"
cask "google-chrome"
cask "postman-agent"    
cask "zen"
cask "claude"
cask "motrix"
caks "whatsapp"
cask "discord"
cask "spotify"
cask "obsidian"
cask "notion"
cask "azure-data-studio"
cask "microsoft-azure-storage-explorer"
cask "warp"
cask "wireshark"
